## Title  :- Pandas Practice
### Name  :- Owais Ur Rehman
### Email :- owaisurrehmands@gmail.com

In [16]:
# import the useful Libraries
import pandas as pd
import numpy as np

In [17]:
# Make a series in pandas
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [18]:
type(s)

pandas.core.series.Series

In [19]:
# Create dataframe by by passing a NumPy array with a datetime index using date_range() and labeled columns
dates = pd.date_range("20240101", periods=10)
dates

DatetimeIndex(['2024-01-01', '2024-01-02', '2024-01-03', '2024-01-04',
               '2024-01-05', '2024-01-06', '2024-01-07', '2024-01-08',
               '2024-01-09', '2024-01-10'],
              dtype='datetime64[ns]', freq='D')

In [20]:
# Creating a dataframe which will be in the shape of rows and column
df = pd.DataFrame(np.random.randn(10, 3), index=dates, columns=list("XYZ"))
df

                   X         Y         Z
2024-01-01  1.240663  1.436987  0.875059
2024-01-02  0.581865 -1.275761  1.671056
2024-01-03 -0.705167 -0.353845 -0.826075
2024-01-04  1.262206  1.079563  0.378228
2024-01-05  0.377341  1.839524  0.028774
2024-01-06 -1.549535  0.350979 -0.358040
2024-01-07  0.091611 -2.069949  0.598949
2024-01-08 -0.181810 -1.516522  1.309388
2024-01-09 -0.980585 -0.754983  0.697198
2024-01-10  0.454522  0.704457 -0.238366

In [21]:
df.head()

                   X         Y         Z
2024-01-01  1.240663  1.436987  0.875059
2024-01-02  0.581865 -1.275761  1.671056
2024-01-03 -0.705167 -0.353845 -0.826075
2024-01-04  1.262206  1.079563  0.378228
2024-01-05  0.377341  1.839524  0.028774

In [22]:
df.tail()

                   X         Y         Z
2024-01-06 -1.549535  0.350979 -0.358040
2024-01-07  0.091611 -2.069949  0.598949
2024-01-08 -0.181810 -1.516522  1.309388
2024-01-09 -0.980585 -0.754983  0.697198
2024-01-10  0.454522  0.704457 -0.238366

In [23]:
df.describe()

               X          Y          Z
count  10.000000  10.000000  10.000000
mean    0.059111  -0.055955   0.413617
std     0.924141   1.337895   0.775885
min    -1.549535  -2.069949  -0.826075
25%    -0.574328  -1.145567  -0.171581
50%     0.234476  -0.001433   0.488589
75%     0.550029   0.985787   0.830594
max     1.262206   1.839524   1.671056

In [24]:
# Dataframe by passing a dictionary of objects where the keys are the column labels and the values are the column values.
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [25]:
# Display the data_type of all column
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

## Viewing Data

In [26]:
df.to_numpy()

array([[ 1.24066339,  1.43698692,  0.87505934],
       [ 0.58186461, -1.2757612 ,  1.67105629],
       [-0.70516735, -0.35384468, -0.82607465],
       [ 1.26220596,  1.07956298,  0.37822788],
       [ 0.37734108,  1.83952392,  0.02877389],
       [-1.54953538,  0.35097906, -0.35804022],
       [ 0.09161114, -2.06994877,  0.59894913],
       [-0.18181016, -1.51652201,  1.30938837],
       [-0.9805846 , -0.75498308,  0.69719817],
       [ 0.45452193,  0.70445731, -0.23836603]])

In [27]:
df[0:3]

                   X         Y         Z
2024-01-01  1.240663  1.436987  0.875059
2024-01-02  0.581865 -1.275761  1.671056
2024-01-03 -0.705167 -0.353845 -0.826075

In [28]:
# Make the transpose of the dataset
df.T

,2024-01-01,2024-01-02,2024-01-03,2024-01-04,2024-01-05,2024-01-06,2024-01-07,2024-01-08,2024-01-09,2024-01-10
X,1.240663,0.581865,-0.705167,1.262206,0.377341,-1.549535,0.091611,-0.181810,-0.980585,0.454522
Y,1.436987,-1.275761,-0.353845,1.079563,1.839524,0.350979,-2.069949,-1.516522,-0.754983,0.704457
Z,0.875059,1.671056,-0.826075,0.378228,0.028774,-0.358040,0.598949,1.309388,0.697198,-0.238366

In [29]:
# This code will sort the data in ascending or decending order
# 1- First sort in ascending order
df.sort_index()

                   X         Y         Z
2024-01-01  1.240663  1.436987  0.875059
2024-01-02  0.581865 -1.275761  1.671056
2024-01-03 -0.705167 -0.353845 -0.826075
2024-01-04  1.262206  1.079563  0.378228
2024-01-05  0.377341  1.839524  0.028774
2024-01-06 -1.549535  0.350979 -0.358040
2024-01-07  0.091611 -2.069949  0.598949
2024-01-08 -0.181810 -1.516522  1.309388
2024-01-09 -0.980585 -0.754983  0.697198
2024-01-10  0.454522  0.704457 -0.238366

In [31]:
# Sorting aganist the columns
df.sort_index(axis=1)

                   X         Y         Z
2024-01-01  1.240663  1.436987  0.875059
2024-01-02  0.581865 -1.275761  1.671056
2024-01-03 -0.705167 -0.353845 -0.826075
2024-01-04  1.262206  1.079563  0.378228
2024-01-05  0.377341  1.839524  0.028774
2024-01-06 -1.549535  0.350979 -0.358040
2024-01-07  0.091611 -2.069949  0.598949
2024-01-08 -0.181810 -1.516522  1.309388
2024-01-09 -0.980585 -0.754983  0.697198
2024-01-10  0.454522  0.704457 -0.238366

In [33]:
# Sortnig by values
sbv= pd.DataFrame({
     'col1': ['A', 'A', 'B', np.nan, 'D', 'C'],
     'col2': [2, 1, 9, 8, 7, 4],
     'col3': [0, 1, 9, 4, 2, 3],
     'col4': ['a', 'B', 'c', 'D', 'e', 'F']
 })
sbv

  col1  col2  col3 col4
0    A     2     0    a
1    A     1     1    B
2    B     9     9    c
3  NaN     8     4    D
4    D     7     2    e
5    C     4     3    F

In [34]:
# Now sort the values of column
sbv.sort_values(['col1'])

  col1  col2  col3 col4
0    A     2     0    a
1    A     1     1    B
2    B     9     9    c
5    C     4     3    F
4    D     7     2    e
3  NaN     8     4    D

In [39]:
# We can sort with multiple columns as well
sbv.sort_values(by=['col1', 'col2'])

  col1  col2  col3 col4
1    A     1     1    B
0    A     2     0    a
2    B     9     9    c
5    C     4     3    F
4    D     7     2    e
3  NaN     8     4    D

> #### Shown the difference between loc vs iloc

In [41]:
df_loc = pd.DataFrame([[1, 2], [4, 5], [7, 8]],
 index=['cobra', 'viper', 'sidewinder'],
 columns=['max_speed', 'shield'])
df_loc

            max_speed  shield
cobra               1       2
viper               4       5
sidewinder          7       8

In [42]:
df_loc.loc['viper']
# This code return the row as series

max_speed    4
shield       5
Name: viper, dtype: int64

In [43]:
# This will display the data based on the index ranging from 0.....n
df_loc.iloc[2]

max_speed    7
shield       8
Name: sidewinder, dtype: int64

In [44]:
# That code will return the dataframe
df_loc.loc[['cobra','sidewinder']]

            max_speed  shield
cobra               1       2
sidewinder          7       8

In [47]:
# Single label for row and column
df_loc.loc['sidewinder','max_speed']

np.int64(7)

In [48]:
# By using Boolean data type this can be done like this
df_loc.loc[[False, False, True]]
# The first two rows are false that's why the are not printed

            max_speed  shield
sidewinder          7       8

In [51]:
""" This will return the conditional data i.e weather the mention field has data maximum than 6"""
df_loc.loc[df_loc['shield']>2]

            max_speed  shield
viper               4       5
sidewinder          7       8

In [52]:
# Multiple conditional using & that returns a boolean Series (LOGICAL OPERATORS)
df.loc[(df['max_speed'] > 1) & (df['shield'] < 8)]

       max_speed  shield
viper          4       5

#### Setting values

Set value for all items matching the list of labels

In [53]:
# displaying the old dataset
df_loc

            max_speed  shield
cobra               1       2
viper               4       5
sidewinder          7       8

In [55]:
df_loc.loc[['viper', 'sidewinder'], ['shield']] = 100
# Updated Dataframe
df_loc

            max_speed  shield
cobra               1       2
viper               4     100
sidewinder          7     100

In [57]:
# Set value for an entire row
df_loc.loc['cobra']=30
df_loc

            max_speed  shield
cobra              30      30
viper               4     100
sidewinder          7     100

In [59]:
# Setting value for an entire column e.g max_speed column will be updated
df_loc.loc[:,'max_speed']=197
df_loc

            max_speed  shield
cobra             197      30
viper             197     100
sidewinder        197     100

In [62]:
# Setting using a Series or a DataFrame sets the values matching the index labels, not the index positions.
shuffled_df = df_loc.loc[["viper", "cobra", "sidewinder"]]
df_loc.loc[:] += shuffled_df
df_loc

            max_speed  shield
cobra             788     120
viper             788     400
sidewinder        788     400